In [ ]:
import pandas as pd
import numpy as np

In [ ]:
train = pd.read_csv("/content/drive/My Drive/Analytics Vidya Hackthon/train.csv")
train.head()

  user_sequence  user_id  challenge_sequence challenge
0        4576_1     4576                   1   CI23714
1        4576_2     4576                   2   CI23855
2        4576_3     4576                   3   CI24917
3        4576_4     4576                   4   CI23663
4        4576_5     4576                   5   CI23933

In [ ]:
challenge = pd.read_csv("/content/drive/My Drive/Analytics Vidya Hackthon/challenge_data.csv")
challenge.head()

  challenge_ID  programming_language  ... author_gender  author_org_ID
0      CI23478                     2  ...             M      AOI100001
1      CI23479                     2  ...             M      AOI100002
2      CI23480                     1  ...             M      AOI100003
3      CI23481                     1  ...             M      AOI100004
4      CI23482                     2  ...             M      AOI100005

[5 rows x 9 columns]

In [ ]:
challenge.tail(5)

     challenge_ID  programming_language  ... author_gender  author_org_ID
5601      CI29079                     1  ...             M      AOI101717
5602      CI29080                     1  ...             F      AOI101718
5603      CI29081                     1  ...             M      AOI100108
5604      CI29082                     1  ...             M      AOI100108
5605      CI29083                     1  ...             F      AOI100022

[5 rows x 9 columns]

In [ ]:
train_ID = train['challenge'].unique()
train_ID.shape

(5348,)

In [ ]:
chall_ID = challenge['challenge_ID'].unique()
chall_ID.shape

(5606,)

In [ ]:
diff = list(set(chall_ID)-set(train_ID))
len(diff)

# Alternatively
# len(set(chall_ID).symmetric_difference(set(train_ID)))

258

In [ ]:
#Keeping all the challenge_ID in challenge data which is also in train data.
challenge = challenge[~challenge['challenge_ID'].isin(diff)]
challenge.shape

(5348, 9)

In [ ]:
# challenge.to_csv("/content/drive/My Drive/Analytics vidya to CSV/challenge.csv")

In [ ]:
# challenge = pd.read_csv("/content/drive/My Drive/Analytics vidya to CSV/challenge.csv")

In [ ]:
challenge.isna().sum()

challenge_ID               0
programming_language       0
challenge_series_ID       11
category_id             1756
total_submissions        311
publish_date               0
author_ID                 39
author_gender             93
author_org_ID            235
dtype: int64

In [ ]:
challenge.shape

(5348, 9)

In [ ]:
challenge['challenge_series_ID'] = challenge['challenge_series_ID'].fillna('SI2870')

In [ ]:
challenge['challenge_series_ID'].isna().sum()

0

In [ ]:
challenge['publish_date']=pd.to_datetime(challenge["publish_date"])
challenge['Year'] = challenge['publish_date'].dt.year
challenge['Month']=challenge['publish_date'].dt.month
challenge['Day']=challenge['publish_date'].dt.day
challenge.sample(5)

     challenge_ID  programming_language challenge_series_ID  ...  Year  Month Day
584       CI24062                     1              SI2448  ...  2006      4  10
1113      CI24591                     1              SI2503  ...  2003      9  25
817       CI24295                     1              SI2488  ...  2004      1   9
4510      CI28044                     1              SI2740  ...  2009      4   2
639       CI24117                     1              SI2457  ...  2006      2  15

[5 rows x 12 columns]

In [ ]:
challenge.query('programming_language==3 & Year==2010')

     challenge_ID  programming_language challenge_series_ID  ...  Year  Month Day
5546      CI28929                     3              SI2870  ...  2010      1  20

[1 rows x 12 columns]

In [ ]:
challenge['total_submissions'] = challenge['total_submissions'].fillna(challenge.groupby(['Year','programming_language'])['total_submissions'].transform('mean'))

In [ ]:
challenge.dtypes

challenge_ID                    object
programming_language             int64
challenge_series_ID             object
category_id                    float64
total_submissions              float64
publish_date            datetime64[ns]
author_ID                       object
author_gender                   object
author_org_ID                   object
Year                             int64
Month                            int64
Day                              int64
dtype: object

In [ ]:
#Checking the groupby..
data = challenge.groupby(['Year','programming_language'])['total_submissions'].transform('mean')
#data

In [ ]:
challenge['category_id'] = challenge['category_id'].fillna(challenge.groupby(['challenge_series_ID','programming_language'])['category_id'].transform('mean'))

In [ ]:
import random
#we can also use the empirical rule
challenge['category_id'] = challenge['category_id'].fillna(random.randint(28,224))

In [ ]:
challenge['total_submissions'].isna().sum()

1

In [ ]:
challenge['total_submissions'] = challenge['total_submissions'].fillna('126')

In [ ]:
challenge.isna().sum()

challenge_ID              0
programming_language      0
challenge_series_ID       0
category_id               0
total_submissions         0
publish_date              0
author_ID                39
author_gender            93
author_org_ID           235
Year                      0
Month                     0
Day                       0
dtype: int64

In [ ]:
# challenge = challenge.drop('Unnamed: 0',axis=1)

In [ ]:
challenge.to_csv("/content/drive/My Drive/Analytics vidya to CSV/chall2.csv")

In [ ]:
challenge.isna().sum()

challenge_ID              0
programming_language      0
challenge_series_ID       0
category_id               0
total_submissions         0
publish_date              0
author_ID                39
author_gender            93
author_org_ID           235
Year                      0
Month                     0
Day                       0
dtype: int64

In [ ]:
# Working on author_ID and author-org_ID by using model 
# filling author_gender by using forward fill

In [ ]:
# df = pd.read_csv("/content/drive/My Drive/Analytics vidya to CSV/chall2.csv")

In [ ]:
df = challenge

In [ ]:
df.head()

  challenge_ID  programming_language challenge_series_ID  ...  Year Month Day
0      CI23478                     2              SI2445  ...  2006     6   5
1      CI23479                     2              SI2435  ...  2002    10  17
2      CI23480                     1              SI2435  ...  2002    10  16
3      CI23481                     1              SI2710  ...  2003     9  19
4      CI23482                     2              SI2440  ...  2002     3  21

[5 rows x 12 columns]

In [ ]:
df.isna().sum()

challenge_ID              0
programming_language      0
challenge_series_ID       0
category_id               0
total_submissions         0
publish_date              0
author_ID                39
author_gender            93
author_org_ID           235
Year                      0
Month                     0
Day                       0
dtype: int64

In [ ]:
# cleaning data to be suitable for tranining the model
df['author_gender']= df['author_gender'].replace('M', '1')
df['author_gender']= df['author_gender'].replace('F', '0')

df['challenge_ID'] = df['challenge_ID'].str.strip("CI")
df['challenge_series_ID'] = df['challenge_series_ID'].str.strip("SI")
df['author_ID'] = df['author_ID'].str.strip("AI")
df['author_org_ID'] = df['author_org_ID'].str.strip("AOI")

df[['author_ID']] = df[['author_ID']].astype(float)
df[['author_org_ID']] = df[['author_org_ID']].astype(float)
df[['challenge_ID']] = df[['challenge_ID']].astype(float)
df[['challenge_series_ID']] = df[['challenge_series_ID']].astype(float)
df[['author_gender']] = df[['author_gender']].astype(float)
df[['programming_language']] = df[['programming_language']].astype(float)
df[['total_submissions']] = df[['total_submissions']].astype(float)
df[['Year']] = df[['Year']].astype(float)

df = df.drop(['publish_date'], axis = 1) 
# df = df.drop(['Unnamed: 0'], axis = 1)

df['author_gender'].fillna(df['author_gender'].ffill(),inplace=True)

In [ ]:
df.dtypes

challenge_ID            float64
programming_language    float64
challenge_series_ID     float64
category_id             float64
total_submissions       float64
author_ID               float64
author_gender           float64
author_org_ID           float64
Year                    float64
Month                     int64
Day                       int64
dtype: object

In [ ]:
df.isna().sum()

challenge_ID              0
programming_language      0
challenge_series_ID       0
category_id               0
total_submissions         0
author_ID                39
author_gender             0
author_org_ID           235
Year                      0
Month                     0
Day                       0
dtype: int64

In [ ]:
# df.to_csv("/content/drive/My Drive/Analytics vidya to CSV/chall2_cleaned.csv") 

# This csv is cleaned csv which is cleaned as per requirements of format by model for training and predicting missing values.
# use this csv only when want to train model in new notebook. No need to load in this notebook.

In [ ]:
# Working on author_org_ID and creating its train and test data.
train_auth_org_id = df.drop(['author_ID'], axis = 1) 
train_df = train_auth_org_id.dropna(subset=['author_org_ID'],axis='rows')
train_df.shape

(5113, 10)

In [ ]:
train_df.head()

   challenge_ID  programming_language  challenge_series_ID  ...    Year  Month  Day
0       23478.0                   2.0               2445.0  ...  2006.0      6    5
1       23479.0                   2.0               2435.0  ...  2002.0     10   17
2       23480.0                   1.0               2435.0  ...  2002.0     10   16
3       23481.0                   1.0               2710.0  ...  2003.0      9   19
4       23482.0                   2.0               2440.0  ...  2002.0      3   21

[5 rows x 10 columns]

In [ ]:
test_df = train_auth_org_id[train_auth_org_id['author_org_ID'].isna().values]
test_df.shape

(235, 10)

In [ ]:
test_df.head()

    challenge_ID  programming_language  challenge_series_ID  ...    Year  Month  Day
5        23483.0                   2.0               2445.0  ...  2006.0      6    5
19       23497.0                   2.0               2442.0  ...  2006.0      7   17
24       23502.0                   1.0               2435.0  ...  2002.0     10   16
42       23520.0                   2.0               2445.0  ...  2006.0      6    5
46       23524.0                   2.0               2446.0  ...  2003.0      3   21

[5 rows x 10 columns]

In [ ]:
# Manually doing train test split for author_org_ID
X_train = train_df.drop(['author_org_ID'], axis = 1) 
y_train = train_df['author_org_ID']

X_test = test_df.drop(['author_org_ID'], axis = 1)
y_test = test_df['author_org_ID']

In [ ]:
print(X_train.shape)
print(y_train.shape)
print(X_test.shape)
print(y_test.shape)

(5113, 9)
(5113,)
(235, 9)
(235,)

In [ ]:
from sklearn.model_selection import train_test_split 
from sklearn import metrics

In [ ]:
# Training XGBoost model

import xgboost as xgb
XGB_reg = xgb.XGBRegressor(random_state=0) 
XGB_reg.fit(X_train,y_train)
y_pred_xgb = XGB_reg.predict(X_test)
y_pred_xgb

[08:14:56] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

array([100077.67 , 100123.41 , 100060.03 , 100107.41 , 100059.836,
       100119.04 , 100150.48 , 100187.62 , 100147.305, 100191.58 ,
       100154.23 , 100112.07 , 100205.37 , 100193.445, 100174.78 ,
       100177.23 , 100241.4  , 100280.95 , 100244.2  , 100317.67 ,
       100206.07 , 100315.11 , 100272.93 , 100303.48 , 100292.23 ,
       100280.26 , 100292.23 , 100424.05 , 100237.54 , 100340.266,
       100287.86 , 100365.69 , 100380.5  , 100321.625, 100116.74 ,
       100309.02 , 100323.39 , 100559.5  , 100243.07 , 100326.164,
       100243.07 , 100356.38 , 100243.07 , 100243.07 , 100243.07 ,
       100416.57 , 100343.734, 100385.05 , 100341.01 , 100422.66 ,
       100313.39 , 100433.48 , 100433.48 , 100556.29 , 100396.24 ,
       100454.3  , 100345.96 , 100365.39 , 100344.61 , 100515.44 ,
       100533.78 , 100484.59 , 100565.1  , 100596.2  , 100564.12 ,
       100473.11 , 100506.88 , 100442.86 , 100650.31 , 100650.31 ,
       100614.69 , 100792.125, 100859.52 , 100870.77 , 100581.89 ,
       100668.53 , 100666.2  , 100666.2  , 100687.07 , 100987.86 ,
       100574.836, 100958.45 , 100708.266, 100987.86 , 100588.22 ,
       100551.27 , 100574.516, 100557.516, 100557.516, 100523.12 ,
       100718.42 , 100730.24 , 100719.516, 100675.01 , 100675.01 ,
       100675.01 , 100512.66 , 100623.68 , 100663.19 , 100663.19 ,
       100564.9  , 100583.94 , 100642.82 , 100859.52 , 100823.02 ,
       100714.016, 100854.875, 100688.45 , 100677.2  , 100688.45 ,
       100688.45 , 100651.17 , 100435.984, 100671.89 , 100576.4  ,
       100683.9  , 100537.51 , 100635.14 , 100672.125, 101345.24 ,
       100601.88 , 100691.26 , 100663.85 , 100621.43 , 100767.21 ,
       100455.68 , 100747.484, 100808.69 , 100940.01 , 100575.79 ,
       100585.31 , 100337.86 , 100349.414, 100349.414, 100349.414,
       100358.414, 100353.01 , 100353.01 , 100351.27 , 100346.63 ,
       100358.414, 100387.43 , 100346.445, 100371.83 , 100371.83 ,
       100366.42 , 100362.875, 100387.43 , 100570.28 , 100415.66 ,
       100389.23 , 100522.8  , 100546.99 , 100532.95 , 100551.4  ,
       100800.195, 100855.96 , 100855.96 , 100855.96 , 100855.96 ,
       100855.96 , 100844.71 , 100844.71 , 100855.96 , 100855.96 ,
       100818.63 , 100855.96 , 100855.96 , 100844.71 , 100831.17 ,
       100855.96 , 100855.96 , 100855.96 , 100855.96 , 100779.97 ,
       100855.96 , 100855.96 , 100855.96 , 100855.96 , 100877.69 ,
       100844.71 , 100855.96 , 100509.875, 101280.195, 101202.98 ,
       101202.98 , 100641.27 , 100937.836, 100734.336, 100734.336,
       100927.734, 100964.68 , 101158.9  , 100569.47 , 100902.28 ,
       100489.63 , 100680.08 , 100705.2  , 100938.78 , 100880.39 ,
       100877.16 , 100823.48 , 100799.88 , 100750.88 , 100868.5  ,
       100507.48 , 100873.79 , 100963.58 , 100796.87 , 100774.28 ,
       100879.164, 100936.34 , 100875.6  , 100749.914, 100640.38 ,
       100807.09 , 100892.18 , 100809.88 , 100806.766, 100777.37 ,
       100867.06 , 100763.94 , 100867.06 , 100888.94 , 100914.06 ,
       101631.484, 101515.914, 100942.414, 100786.74 , 100786.74 ,
       100678.94 , 100987.62 , 101016.914, 100745.22 , 101595.71 ],
      dtype=float32)

In [ ]:
y_pred_xgb.shape

(235,)

In [ ]:
Predict_auth_org_id=pd.DataFrame(y_pred_xgb, columns=['author_org_ID']) 
Predict_auth_org_id = Predict_auth_org_id.round()
Predict_auth_org_id

     author_org_ID
0         100078.0
1         100123.0
2         100060.0
3         100107.0
4         100060.0
..             ...
230       100679.0
231       100988.0
232       101017.0
233       100745.0
234       101596.0

[235 rows x 1 columns]

In [ ]:
# For author id

In [ ]:
# Working on author_ID and creating its train and test data.
train_auth_id = df.drop(['author_org_ID'], axis = 1) 
train_df2 = train_auth_id.dropna(subset=['author_ID'],axis='rows')
train_df2.shape

(5309, 10)

In [ ]:
test_df2 = train_auth_id[train_auth_id['author_ID'].isna().values]
test_df2.shape

(39, 10)

In [ ]:
# Manually doing train test split for author_org_ID
X_train2 = train_df2.drop(['author_ID'], axis = 1) 
y_train2 = train_df2['author_ID']

X_test2 = test_df2.drop(['author_ID'], axis = 1)
y_test2 = test_df2['author_ID']

In [ ]:
print(X_train2.shape)
print(y_train2.shape)
print(X_test2.shape)
print(y_test2.shape)

(5309, 9)
(5309,)
(39, 9)
(39,)

In [ ]:
# Training XGBoost model

import xgboost as xgb
XGB_reg2 = xgb.XGBRegressor(random_state=0) 
XGB_reg2.fit(X_train2,y_train2)
y_pred_xgb2 = XGB_reg2.predict(X_test2)
y_pred_xgb2

[08:14:56] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

array([563675.4 , 563695.25, 563695.25, 563721.7 , 563855.  , 563839.25,
       563935.06, 563914.56, 563980.2 , 564152.3 , 564240.56, 564275.1 ,
       564281.75, 564351.  , 564345.4 , 564518.75, 564518.8 , 564525.1 ,
       564507.9 , 564420.6 , 564535.94, 564914.1 , 565239.44, 565239.44,
       565013.5 , 565454.25, 565404.56, 565404.56, 565443.44, 565404.56,
       565443.44, 565698.1 , 565564.25, 565555.6 , 566293.56, 565850.25,
       565850.25, 565928.44, 566185.94], dtype=float32)

In [ ]:
y_pred_xgb2.shape

(39,)

In [ ]:
Predict_auth_id=pd.DataFrame(y_pred_xgb2, columns=['author_ID']) 
Predict_auth_id = Predict_auth_id.round()
Predict_auth_id

    author_ID
0    563675.0
1    563695.0
2    563695.0
3    563722.0
4    563855.0
5    563839.0
6    563935.0
7    563915.0
8    563980.0
9    564152.0
10   564241.0
11   564275.0
12   564282.0
13   564351.0
14   564345.0
15   564519.0
16   564519.0
17   564525.0
18   564508.0
19   564421.0
20   564536.0
21   564914.0
22   565239.0
23   565239.0
24   565014.0
25   565454.0
26   565405.0
27   565405.0
28   565443.0
29   565405.0
30   565443.0
31   565698.0
32   565564.0
33   565556.0
34   566294.0
35   565850.0
36   565850.0
37   565928.0
38   566186.0

In [ ]:
# Merging predicted values of author_id to its splitted test data set

In [ ]:
X_test2.reset_index(inplace=True)

In [ ]:
Predict_auth_id.reset_index(inplace=True)

In [ ]:
X_test2['author_ID'] = Predict_auth_id['author_ID'].values

In [ ]:
X_test2['author_ID'].count()

39

In [ ]:
X_test2.head()

   index  challenge_ID  programming_language  ...  Month  Day  author_ID
0      5       23483.0                   2.0  ...      6    5   563675.0
1     19       23497.0                   2.0  ...      7   17   563695.0
2     42       23520.0                   2.0  ...      6    5   563695.0
3    135       23613.0                   1.0  ...      1    5   563722.0
4    305       23783.0                   1.0  ...      8   12   563855.0

[5 rows x 11 columns]

In [ ]:
X_test2.shape

(39, 11)

In [ ]:
#  Merging predicted values of author_org_id to its splitted test data set

In [ ]:
X_test.reset_index(inplace=True)
Predict_auth_org_id.reset_index(inplace=True)

In [ ]:
X_test['author_org_ID'] = Predict_auth_org_id['author_org_ID'].values

In [ ]:
X_test.head()

   index  challenge_ID  programming_language  ...  Month  Day  author_org_ID
0      5       23483.0                   2.0  ...      6    5       100078.0
1     19       23497.0                   2.0  ...      7   17       100123.0
2     24       23502.0                   1.0  ...     10   16       100060.0
3     42       23520.0                   2.0  ...      6    5       100107.0
4     46       23524.0                   2.0  ...      3   21       100060.0

[5 rows x 11 columns]

In [ ]:
# making a copy dataframe of original dataframe

In [ ]:
dfcp = df
dfcp.head()

   challenge_ID  programming_language  challenge_series_ID  ...    Year  Month  Day
0       23478.0                   2.0               2445.0  ...  2006.0      6    5
1       23479.0                   2.0               2435.0  ...  2002.0     10   17
2       23480.0                   1.0               2435.0  ...  2002.0     10   16
3       23481.0                   1.0               2710.0  ...  2003.0      9   19
4       23482.0                   2.0               2440.0  ...  2002.0      3   21

[5 rows x 11 columns]

In [ ]:
#concatenating train and test of author_ID and get the complete dataset.

In [ ]:
frames = [train_df2, X_test2]

new_auth_id = pd.concat(frames,join='outer',ignore_index=False,copy=True)

In [ ]:
new_auth_id.reset_index(inplace=True)

In [ ]:
new_auth_id.head()

   level_0  challenge_ID  programming_language  ...  Month  Day  index
0        0       23478.0                   2.0  ...      6    5    NaN
1        1       23479.0                   2.0  ...     10   17    NaN
2        2       23480.0                   1.0  ...     10   16    NaN
3        3       23481.0                   1.0  ...      9   19    NaN
4        4       23482.0                   2.0  ...      3   21    NaN

[5 rows x 12 columns]

In [ ]:
new_auth_id.drop(["index","level_0"],axis=1,inplace=True)

In [ ]:
new_auth_id = new_auth_id[['challenge_ID','author_ID']]

In [ ]:
new_auth_id.set_index('challenge_ID',inplace=True)

In [ ]:
new_auth_id.head()

              author_ID
challenge_ID
23478.0        563576.0
23479.0        563577.0
23480.0        563578.0
23481.0        563579.0
23482.0        563580.0

In [ ]:
# dropping these columns as we will take these columns from our other data set on which we have set index to perform join and place values to their corresponding challenge_ID values in our main dataframe
dfcp = dfcp.drop(['author_ID','author_org_ID'],axis=1)

In [ ]:
dfcp.head()

   challenge_ID  programming_language  challenge_series_ID  ...    Year  Month  Day
0       23478.0                   2.0               2445.0  ...  2006.0      6    5
1       23479.0                   2.0               2435.0  ...  2002.0     10   17
2       23480.0                   1.0               2435.0  ...  2002.0     10   16
3       23481.0                   1.0               2710.0  ...  2003.0      9   19
4       23482.0                   2.0               2440.0  ...  2002.0      3   21

[5 rows x 9 columns]

In [ ]:
# joining author_ID values in our main dataframe
dfcp = dfcp.join(new_auth_id, on='challenge_ID')

In [ ]:
dfcp.head()

   challenge_ID  programming_language  ...  Day  author_ID
0       23478.0                   2.0  ...    5   563576.0
1       23479.0                   2.0  ...   17   563577.0
2       23480.0                   1.0  ...   16   563578.0
3       23481.0                   1.0  ...   19   563579.0
4       23482.0                   2.0  ...   21   563580.0

[5 rows x 10 columns]

In [ ]:
#concatenating train and test of author_org_ID and get the complete dataset.

In [ ]:
frames = [train_df, X_test]

new_auth_org_id = pd.concat(frames,join='outer',ignore_index=False,copy=True)

In [ ]:
new_auth_org_id.reset_index(inplace=True)

In [ ]:
new_auth_org_id.drop(['index','level_0'],inplace=True,axis=1)

In [ ]:
new_auth_org_id.head()

   challenge_ID  programming_language  challenge_series_ID  ...    Year  Month  Day
0       23478.0                   2.0               2445.0  ...  2006.0      6    5
1       23479.0                   2.0               2435.0  ...  2002.0     10   17
2       23480.0                   1.0               2435.0  ...  2002.0     10   16
3       23481.0                   1.0               2710.0  ...  2003.0      9   19
4       23482.0                   2.0               2440.0  ...  2002.0      3   21

[5 rows x 10 columns]

In [ ]:
new_auth_org_id = new_auth_org_id[['challenge_ID','author_org_ID']]

In [ ]:
new_auth_org_id.set_index('challenge_ID')

              author_org_ID
challenge_ID
23478.0            100001.0
23479.0            100002.0
23480.0            100003.0
23481.0            100004.0
23482.0            100005.0
...                     ...
28271.0            100679.0
28276.0            100988.0
28566.0            101017.0
28688.0            100745.0
29027.0            101596.0

[5348 rows x 1 columns]

In [ ]:
# Merging author_org_ID values in our main dataframe
dfcp = dfcp.merge(new_auth_org_id, on='challenge_ID')

In [ ]:
dfcp.head()

   challenge_ID  programming_language  ...  author_ID  author_org_ID
0       23478.0                   2.0  ...   563576.0       100001.0
1       23479.0                   2.0  ...   563577.0       100002.0
2       23480.0                   1.0  ...   563578.0       100003.0
3       23481.0                   1.0  ...   563579.0       100004.0
4       23482.0                   2.0  ...   563580.0       100005.0

[5 rows x 11 columns]

In [ ]:
# Checking that values are filled to their propre places

In [ ]:
df[df['author_ID'].isnull()].index

Int64Index([   5,   19,   42,  135,  305,  360,  531,  582,  784,  845, 1087,
            1199, 1300, 1347, 1361, 1570, 1631, 1632, 1667, 1699, 1749, 2347,
            2631, 2642, 2650, 2756, 2923, 2931, 2944, 2949, 3164, 3644, 3785,
            3932, 4356, 4552, 4559, 4912, 5242],
           dtype='int64')

In [ ]:
df.iloc[18]

challenge_ID            23497.0
programming_language        2.0
challenge_series_ID      2442.0
category_id                70.0
total_submissions         195.0
author_ID                   NaN
author_gender               1.0
author_org_ID               NaN
Year                     2006.0
Month                       7.0
Day                        17.0
Name: 19, dtype: float64

In [ ]:
dfcp.iloc[18]

challenge_ID             23497.0
programming_language         2.0
challenge_series_ID       2442.0
category_id                 70.0
total_submissions          195.0
author_gender                1.0
Year                      2006.0
Month                        7.0
Day                         17.0
author_ID               563695.0
author_org_ID           100123.0
Name: 18, dtype: float64

In [ ]:
dfcp[dfcp['challenge_ID']==23497.0]

    challenge_ID  programming_language  ...  author_ID  author_org_ID
18       23497.0                   2.0  ...   563695.0       100123.0

[1 rows x 11 columns]

In [ ]:
dfcp.head()

   challenge_ID  programming_language  ...  author_ID  author_org_ID
0       23478.0                   2.0  ...   563576.0       100001.0
1       23479.0                   2.0  ...   563577.0       100002.0
2       23480.0                   1.0  ...   563578.0       100003.0
3       23481.0                   1.0  ...   563579.0       100004.0
4       23482.0                   2.0  ...   563580.0       100005.0

[5 rows x 11 columns]

In [ ]:
# Adding all the original format of the data set back to it

In [ ]:
dfcp['challenge_ID'] = 'CI' + dfcp['challenge_ID'].astype(str)
dfcp['challenge_series_ID'] = 'SI' + dfcp['challenge_series_ID'].astype(str)
dfcp['author_ID'] = 'AI' + dfcp['author_ID'].astype(str)
dfcp['author_org_ID'] = 'AOI' + dfcp['author_org_ID'].astype(str)

In [ ]:
dfcp[['author_gender']] = dfcp[['author_gender']].astype(str)
dfcp['author_gender']= dfcp['author_gender'].replace('1.0', 'M')
dfcp['author_gender']= dfcp['author_gender'].replace('0.0', 'F')

In [ ]:
dfcp.head(10)

  challenge_ID  programming_language  ...   author_ID  author_org_ID
0    CI23478.0                   2.0  ...  AI563576.0    AOI100001.0
1    CI23479.0                   2.0  ...  AI563577.0    AOI100002.0
2    CI23480.0                   1.0  ...  AI563578.0    AOI100003.0
3    CI23481.0                   1.0  ...  AI563579.0    AOI100004.0
4    CI23482.0                   2.0  ...  AI563580.0    AOI100005.0
5    CI23483.0                   2.0  ...  AI563675.0    AOI100078.0
6    CI23484.0                   1.0  ...  AI563582.0    AOI100007.0
7    CI23485.0                   1.0  ...  AI563583.0    AOI100008.0
8    CI23486.0                   2.0  ...  AI563584.0    AOI100009.0
9    CI23488.0                   2.0  ...  AI563586.0    AOI100011.0

[10 rows x 11 columns]

In [ ]:
dfcp.shape

(5348, 11)

In [ ]:
dfcp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5348 entries, 0 to 5347
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   challenge_ID          5348 non-null   object
 1   programming_language  5348 non-null   float64
 2   challenge_series_ID   5348 non-null   object
 3   category_id           5348 non-null   float64
 4   total_submissions     5348 non-null   float64
 5   author_gender         5348 non-null   object
 6   Year                  5348 non-null   float64
 7   Month                 5348 non-null   int64
 8   Day                   5348 non-null   int64
 9   author_ID             5348 non-null   object
 10  author_org_ID         5348 non-null   object
dtypes: float64(4), int64(2), object(5)
memory usage: 501.4+ KB

In [ ]:
# creating final csv
# dfcp.to_csv('/content/drive/My Drive/Analytics vidya to CSV/chall_final.csv', index=False)

In [ ]:
#loading and checking final csv

In [ ]:
# final = pd.read_csv("/content/drive/My Drive/Analytics vidya to CSV/chall_final.csv")

In [ ]:
# This is our final data set on which we have to apply recommendation model. we can use it directly as shown below.
# OR
# Can save to csv file and then import that file.

In [ ]:
final = dfcp

In [ ]:
final.head()

  challenge_ID  programming_language  ...   author_ID  author_org_ID
0    CI23478.0                   2.0  ...  AI563576.0    AOI100001.0
1    CI23479.0                   2.0  ...  AI563577.0    AOI100002.0
2    CI23480.0                   1.0  ...  AI563578.0    AOI100003.0
3    CI23481.0                   1.0  ...  AI563579.0    AOI100004.0
4    CI23482.0                   2.0  ...  AI563580.0    AOI100005.0

[5 rows x 11 columns]

In [ ]:
final.shape

(5348, 11)

In [ ]:
final.describe()

       programming_language  category_id  ...        Month          Day
count           5348.000000  5348.000000  ...  5348.000000  5348.000000
mean               1.076103    80.094078  ...     6.933807    14.424832
std                0.305190    49.643656  ...     3.169324     8.019809
min                0.000000    22.000000  ...     1.000000     1.000000
25%                1.000000    40.000000  ...     4.000000     8.000000
50%                1.000000    69.000000  ...     7.000000    12.000000
75%                1.000000   107.000000  ...     9.000000    21.000000
max                3.000000   304.000000  ...    12.000000    31.000000

[8 rows x 6 columns]

In [ ]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5348 entries, 0 to 5347
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   challenge_ID          5348 non-null   object
 1   programming_language  5348 non-null   float64
 2   challenge_series_ID   5348 non-null   object
 3   category_id           5348 non-null   float64
 4   total_submissions     5348 non-null   float64
 5   author_gender         5348 non-null   object
 6   Year                  5348 non-null   float64
 7   Month                 5348 non-null   int64
 8   Day                   5348 non-null   int64
 9   author_ID             5348 non-null   object
 10  author_org_ID         5348 non-null   object
dtypes: float64(4), int64(2), object(5)
memory usage: 501.4+ KB

In [ ]:
final.isna().sum()

challenge_ID            0
programming_language    0
challenge_series_ID     0
category_id             0
total_submissions       0
author_gender           0
Year                    0
Month                   0
Day                     0
author_ID               0
author_org_ID           0
dtype: int64

In [ ]:
final.isnull().sum()

challenge_ID            0
programming_language    0
challenge_series_ID     0
category_id             0
total_submissions       0
author_gender           0
Year                    0
Month                   0
Day                     0
author_ID               0
author_org_ID           0
dtype: int64